package com.example.hp.demo.constant;

import java.util.HashMap;

/*
 * 朗霞pcs是pgs没有坐标，而我们列表里有的pcs
 * */
public class PcsNingbo extends BasePcsDetail {

    public static PcsNingbo instance;
    private HashMap<String, Double> mapXQLon;
    private HashMap<String, Double> mapXQLat;
    private HashMap<String, Double> mapPCSLon;
    private HashMap<String, Double> mapPCSLat;

    public static PcsNingbo getInstance() {
        if (instance == null) {
            instance = new PcsNingbo();
        }
        return instance;
    }

    public PcsNingbo() {


        m_slistPCSName = new String[]{
                "海曙区",
                "江东区",
                "江北区",// 洪塘
                "北仑区",
                "大榭区",
                "镇海区",
                "鄞州区",
                "余姚市",
                "慈溪市",
                "奉化市",
                "宁海县",
                "象山县",
                /*"宁波港",*/
                "高新区",
        };


        pcsCodeMap = new HashMap<String, String>() {
            {
                put("海曙区", "330203");
                put("江东区", "330204");
                put("江北区", "330205");// 洪塘
                put("北仑区", "330206");
                put("大榭区", "330293");//330207
                put("镇海区", "330211");
                put("鄞州区", "330212");
                put("余姚市", "330281");
                put("慈溪市", "330282");
                put("奉化市", "330283");
                put("宁海县", "330226");
                put("象山县", "330225");
				/*put("宁波港", "330200T");*/
                put("高新区", "330299");
            }
        };

        mapXQLon = new HashMap<String, Double>() {
            {
                put("海曙区", 121.54030904021909);
                put("江东区", 121.56916259908883);
                put("江北区", 121.56190733030542);// 洪塘
                put("北仑区", 121.8499513384171);
                put("大榭区", 121.94248054137404);
                put("镇海区", 121.71701440388404);
                put("鄞州区", 121.53753143303163);
                put("余姚市", 121.15478286786072);
                put("慈溪市", 121.24448957886614);
                put("奉化市", 121.39974204624139);
                put("宁海县", 121.42621061216175);
                put("象山县", 121.8665846917878);
                put("宁波港", 121.76527692737125);
                put("高新区", 121.76527692737125);
            }
        };
        mapXQLat = new HashMap<String, Double>() {
            {
                put("海曙区", 29.879426908336626);
                put("江东区", 29.878726209152575);
                put("江北区", 29.902108407212694);// 洪塘
                put("北仑区", 29.912236499178306);
                put("大榭区", 29.896609096296032);
                put("镇海区", 29.95394406951752);
                put("鄞州区", 29.817700972028632);
                put("余姚市", 30.045970121206864);
                put("慈溪市", 30.181117233686763);
                put("奉化市", 29.6521601797551);
                put("宁海县", 29.28194313896276);
                put("象山县", 29.46497026149629);
                put("宁波港", 29.91348742322336);
                put("高新区", 29.890973365310145);
            }
        };
        mapPCSLon = new HashMap<String, Double>() {
            {
                put("中心派出所", 121.60004694);
                put("鹿亭派出所", 121.20150283);
                put("白云派出所", 121.51752216);
                put("鼓楼派出所", 121.54762226);
                put("江厦派出所", 121.54585072);
                put("南门派出所", 121.52694672);
                put("南站派出所", 121.53555183);
                put("望春派出所", 121.51732006);
                put("西门派出所", 121.53471074);
                put("月湖派出所", 121.54119436);
                put("白鹤派出所", 121.56684211);
                put("百丈派出所", 121.56622019);
                put("西周派出所", 121.67124426);
                put("丹城派出所", 121.87133931);
                put("鹤浦派出所", 121.90255813);
                put("梅林派出所", 121.43693269);
                put("墙头派出所", 121.77697727);
                put("莼湖派出所", 121.51422267);
                put("大徐派出所", 121.88213658);
                put("岳林派出所刑侦中队", 121.43562737);
                put("大桥派出所", 121.40772600);
                put("尚田派出所", 121.40615903);
                put("岳林派出所", 121.43559133);
                put("裘村派出所", 121.61497065);
                put("四明山派出所", 121.11432916);
                put("萧王庙派出所", 121.35292945);
                put("大佳何派出所", 121.54692182);
                put("周巷中心派出所", 121.12858207);
                put("高桥派出所", 121.46154352);
                put("古林派出所", 121.43198558);
                put("横街派出所", 121.39411985);
                put("西坞派出所", 121.48184273);
                put("集仕港派出所", 121.43371744);
                put("森林派出所", 121.83351593);
                put("霞浦派出所", 121.88133043);
                put("梨洲派出所", 121.15422003);
                put("陆埠派出所", 121.23723608);
                put("大隐派出所", 121.36791581);
                put("洪塘派出所", 121.50428340);
                put("庄桥派出所", 121.54905248);
                put("骆驼派出所", 121.57819919);
                put("庄市派出所", 121.61010491);
                put("小港派出所", 121.73553775);
                put("蛟川派出所", 121.64456354);
                put("招宝山派出所", 121.68874565);
                put("大碶派出所", 121.79390374);
                put("柴桥派出所", 121.91646220);
                put("河姆渡派出所", 121.30977326);
                put("白峰派出所", 121.98892148);
                put("慈城派出所", 121.44801958);
                put("北仑港区派出所", 121.86589274);
                put("新碶派出所", 121.82303952);
                put("甬保派出所", 121.83615732);
                put("牟山派出所", 120.99321362);
                put("江口派出所", 121.40239624);
                put("咸祥派出所", 121.77955770);
                put("瞻岐派出所", 121.81911238);
                put("大岚派出所", 121.12545143);
                put("龙观派出所", 121.31701264);
                put("鄞江派出所", 121.35086817);
                put("章水派出所", 121.29256105);
                put("洞桥派出所", 121.40751397);
                put("机场派出所", 121.45925680);
                put("石碶派出所", 121.49160006);
                put("姜山派出所", 121.53406754);
                put("文华派出所", 121.55938570);
                put("大堰派出所", 121.30358740);
                put("塘溪派出所", 121.71047982);
                put("横溪派出所", 121.59246721);
                put("下应派出所", 121.58523323);
                put("云龙派出所", 121.59683307);
                put("钟公庙派出所", 121.51784911);
                put("东吴派出所", 121.73706492);
                put("春晓派出所", 121.88215618);
                put("梅山边防派出所", 121.99043328);
                put("梁弄派出所", 121.06903602);
                put("东郊派出所", 121.57444782);
                put("东柳派出所", 121.58159876);
                put("东胜派出所", 121.56821038);
                put("福明派出所", 121.59838679);
                put("公交派出所", 121.56686153);
                put("明楼派出所", 121.57213324);
                put("段塘派出所", 121.52294662);
                put("孔浦派出所", 121.58651459);
                put("文教派出所", 121.53604615);
                put("中马派出所", 121.55296839);
                put("邱隘派出所", 121.63481174);
                put("五乡派出所", 121.68830460);
                put("桑洲派出所", 121.31175272);
                put("岔路派出所", 121.30811466);
                put("前童派出所", 121.34283891);
                put("一市边防派出所", 121.47485963);
                put("长街派出所", 121.70989654);
                put("低塘派出所", 121.84054375);
                put("石浦派出所", 121.92456302);
                put("黄坛派出所", 121.35789754);
                put("跃龙派出所", 121.42903150);
                put("茶院派出所", 121.56820093);
                put("白沙派出所", 121.55297645);
                put("力洋派出所", 121.59995335);
                put("越溪派出所", 121.51701764);
                put("胡陈派出所", 121.67271682);
                put("新桥派出所", 121.86388147);
                put("桥头胡派出所", 121.47941676);
                put("桃源派出所", 121.44472914);
                put("泗洲头派出所", 121.76974410);
                put("深甽派出所", 121.34002532);
                put("西店派出所", 121.43513676);
                put("西北派出所", 121.14778870);
                put("三七市派出所", 121.34045317);
                put("丈亭派出所", 121.28964375);
                put("蟹浦派出所", 121.59960351);
                put("龙山派出所", 121.55269826);
                put("老方桥派出所", 121.08396957);
                put("泗门派出所", 121.03655776);
                put("横河派出所", 121.23722757);
                put("桥头派出所", 121.35589069);
                put("范市派出所", 121.47740835);
                put("掌起派出所", 121.45505296);
                put("镇海港区派出所", 121.71847477);
                put("九龙湖派出所", 121.54850624);
                put("三北派出所", 121.49810794);
                put("小曹娥派出所", 121.06989770);
                put("长河派出所", 121.17166069);
                put("宗汉派出所", 121.20744120);
                put("浒山中心派出所", 121.25764412);
                put("坎墩派出所", 121.25791093);
                put("胜山派出所", 121.32488739);
                put("逍林派出所", 121.31819162);
                put("新浦派出所", 121.36555383);
                put("附海派出所", 121.39378637);
                put("观海卫中心派出所", 121.39461905);
                put("庵东派出所", 121.22171112);
                put("崇寿派出所", 121.27143956);
                put("天元派出所", 121.17728810);
                put("杭州湾派出所", 121.29755777);
                put("黄家埠派出所", 120.96029081);
                put("临山派出所", 120.99312469);
                put("马渚派出所", 121.05127341);
                put("凤山派出所", 121.15381901);
                put("兰江派出所", 121.14881934);
            }
        };


        mapPCSLat = new HashMap<String, Double>() {
            {
                put("中心派出所", 29.81767272);
                put("鹿亭派出所", 29.87851657);
                put("白云派出所", 29.87730653);
                put("鼓楼派出所", 29.87752217);
                put("江厦派出所", 29.87050909);
                put("南门派出所", 29.87035703);
                put("南站派出所", 29.86448205);
                put("望春派出所", 29.89453481);
                put("西门派出所", 29.88865666);
                put("月湖派出所", 29.86366204);
                put("白鹤派出所", 29.85502012);
                put("百丈派出所", 29.86298523);
                put("西周派出所", 29.48503411);
                put("丹城派出所", 29.47097648);
                put("鹤浦派出所", 29.15265197);
                put("梅林派出所", 29.38466296);
                put("墙头派出所", 29.46758683);
                put("莼湖派出所", 29.56870885);
                put("大徐派出所", 29.52849277);
                put("岳林派出所刑侦中队", 29.66163686);
                put("大桥派出所", 29.66709673);
                put("尚田派出所", 29.61701383);
                put("岳林派出所", 29.66137791);
                put("裘村派出所", 29.60375385);
                put("四明山派出所", 29.73779432);
                put("萧王庙派出所", 29.70395328);
                put("大佳何派出所", 29.42465589);
                put("周巷中心派出所", 30.18855641);
                put("高桥派出所", 29.90852590);
                put("古林派出所", 29.83814630);
                put("横街派出所", 29.85957557);
                put("西坞派出所", 29.67923201);
                put("集仕港派出所", 29.86762761);
                put("森林派出所", 29.91742073);
                put("霞浦派出所", 29.88677561);
                put("梨洲派出所", 29.99908181);
                put("陆埠派出所", 29.98905965);
                put("大隐派出所", 29.93631288);
                put("洪塘派出所", 29.95513778);
                put("庄桥派出所", 29.93307086);
                put("骆驼派出所", 29.98723777);
                put("庄市派出所", 29.92830952);
                put("小港派出所", 29.95010427);
                put("蛟川派出所", 29.97495773);
                put("招宝山派出所", 29.95977516);
                put("大碶派出所", 29.89935181);
                put("柴桥派出所", 29.87829871);
                put("河姆渡派出所", 29.99207035);
                put("白峰派出所", 29.88377987);
                put("慈城派出所", 29.98619909);
                put("北仑港区派出所", 29.92198818);
                put("新碶派出所", 29.92123655);
                put("甬保派出所", 29.92933505);
                put("牟山派出所", 30.07763335);
                put("江口派出所", 29.72772017);
                put("咸祥派出所", 29.68217020);
                put("瞻岐派出所", 29.72574270);
                put("大岚派出所", 29.82532536);
                put("龙观派出所", 29.77051362);
                put("鄞江派出所", 29.77153930);
                put("章水派出所", 29.81945738);
                put("洞桥派出所", 29.78627741);
                put("机场派出所", 29.82005291);
                put("石碶派出所", 29.81588220);
                put("姜山派出所", 29.77472459);
                put("文华派出所", 29.81002726);
                put("大堰派出所", 29.50657522);
                put("塘溪派出所", 29.66423877);
                put("横溪派出所", 29.71836732);
                put("下应派出所", 29.81247506);
                put("云龙派出所", 29.77016475);
                put("钟公庙派出所", 29.82261722);
                put("东吴派出所", 29.81927348);
                put("春晓派出所", 29.77324093);
                put("梅山边防派出所", 29.79728168);
                put("梁弄派出所", 29.91526815);
                put("东郊派出所", 29.86988642);
                put("东柳派出所", 29.85995083);
                put("东胜派出所", 29.87867255);
                put("福明派出所", 29.86646885);
                put("公交派出所", 29.87870311);
                put("明楼派出所", 29.88487150);
                put("段塘派出所", 29.84418329);
                put("孔浦派出所", 29.90543977);
                put("文教派出所", 29.89825505);
                put("中马派出所", 29.88991826);
                put("邱隘派出所", 29.84717466);
                put("五乡派出所", 29.84612410);
                put("桑洲派出所", 29.15667298);
                put("岔路派出所", 29.21115627);
                put("前童派出所", 29.23184806);
                put("一市边防派出所", 29.19827766);
                put("长街派出所", 29.24625114);
                put("低塘派出所", 29.23554245);
                put("石浦派出所", 29.20189462);
                put("黄坛派出所", 29.30022042);
                put("跃龙派出所", 29.29773384);
                put("茶院派出所", 29.31753543);
                put("白沙派出所", 29.89082208);
                put("力洋派出所", 29.30545521);
                put("越溪派出所", 29.26993405);
                put("胡陈派出所", 29.32778890);
                put("新桥派出所", 29.31806948);
                put("桥头胡派出所", 29.38686017);
                put("桃源派出所", 29.34275035);
                put("泗洲头派出所", 29.37400733);
                put("深甽派出所", 29.41958838);
                put("西店派出所", 29.48876333);
                put("西北派出所", 30.06184544);
                put("三七市派出所", 30.03333948);
                put("丈亭派出所", 30.01319040);
                put("蟹浦派出所", 30.03335788);
                put("龙山派出所", 30.07519092);
                put("老方桥派出所", 30.10125255);
                put("泗门派出所", 30.15576274);
                put("横河派出所", 30.13162144);
                put("桥头派出所", 30.16301398);
                put("范市派出所", 30.10590419);
                put("掌起派出所", 30.11912419);
                put("镇海港区派出所", 29.96416780);
                put("九龙湖派出所", 30.03557797);
                put("三北派出所", 30.09694775);
                put("小曹娥派出所", 30.21946098);
                put("长河派出所", 30.22726208);
                put("宗汉派出所", 30.19057436);
                put("浒山中心派出所", 30.17531975);
                put("坎墩派出所", 30.21949048);
                put("胜山派出所", 30.23616450);
                put("逍林派出所", 30.17705487);
                put("新浦派出所", 30.24706028);
                put("附海派出所", 30.22412923);
                put("观海卫中心派出所", 30.17648759);
                put("庵东派出所", 30.27227865);
                put("崇寿派出所", 30.27072798);
                put("天元派出所", 30.19096158);
                put("杭州湾派出所", 30.29847051);
                put("黄家埠派出所", 30.12912084);
                put("临山派出所", 30.14686365);
                put("马渚派出所", 30.07724111);
                put("凤山派出所", 30.05330419);
                put("兰江派出所", 30.02815391);
            }
        };


        //key对应于App使用时选择辖区的行政区划code
        //value对应于单位机构管理数据
        dept2jgidMap = new HashMap<String, String>() {
            {
                put("330205530000", "330205056");
                put("330225590000", "330225004");
                put("330206550000", "330206085");
                put("330205580000", "330205064");
                put("330207510000", "330207510");
                put("330226560000", "330226018");
                put("330282790000", "330282001");
                put("330225610000", "330225610");
                put("330283520000", "330283002");
                put("330206540000", "330206086");
                put("330281530000", "330281025");
                put("330281660000", "330281009");
                put("330281950000", "330281006");
                put("330207050000", "330207050");
                put("330203530000", "330203005");
                put("330282680000", "330282017");
                put("330226590000", "330226012");
                put("330211560000", "330211078");
                put("330283040505", "330283006");
                put("330281620000", "330281005");
                put("330283590000", "330283008");
                put("330226550000", "330226017");
                put("330282710000", "330282021");
                put("330281680000", "330281008");
                put("330282810000", "330282026");
                put("330281650000", "330281023");
                put("330204570000", "330204570");
                put("330299520000", "330299520");
                put("330227580000", "330212008");
                put("330283620000", "330283620");
                put("330203550000", "330203006");
                put("330206580000", "330206089");
                put("330225570000", "330225006");
                put("330227680000", "330212017");
                put("330282630000", "330282013");
                put("330283580000", "330283009");
                put("330227780000", "330212005");
                put("330281510000", "330281007");
                put("330282550000", "330282018");
                put("330282640000", "330282014");
                put("330204550000", "330204022");
                put("330204590000", "330204026");
                put("330227730000", "330212422");
                put("330283610000", "330283011");
                put("330282770000", "330282020");
                put("330211550000", "330211068");
                put("330206040200", "330206088");
                put("330281700000", "330281021");
                put("330283550000", "330283010");
                put("330226650000", "330226021");
                put("330206980000", "330206091");
                put("330292520000", "330282024");
                put("330225560000", "330225009");
                put("330206570000", "330206080");
                put("330226570000", "330226016");
                put("330281640000", "330281018");
                put("330299510000", "330299510");
                put("330225710000", "330225001");
                put("330225510000", "330225002");
                put("330281570000", "330281004");
                put("330211540000", "330211062");
                put("330292510000", "330282021");
                put("330211520000", "330211064");
                put("330205570000", "330205063");
                put("330225530000", "330225008");
                put("330206520000", "330206083");
                put("330227520000", "330212401");
                put("330281670000", "330281016");
                put("330283570000", "330283005");
                put("330226540000", "330226013");
                put("330295550000", "330295550");
                put("330227640000", "330212011");
                put("330295510000", "330295510");
                put("330205590000", "330205052");
                put("330281560000", "330281014");
                put("330282750000", "330282025");
                put("330282780000", "330282005");
                put("330226980000", "330226001");
                put("330281610000", "330281011");
                put("330227760000", "330212423");
                put("330281540000", "330281026");
                put("330203560000", "330203007");
                put("330227560000", "330212007");
                put("330227620000", "330212410");
                put("330227540000", "330212003");
                put("330225720000", "330225015");
                put("330283530000", "330283003");
                put("330206510000", "330206081");
                put("330211510000", "330211061");
                put("330227660000", "330212014");
                put("330227740000", "330212025");
                put("330295520000", "330295520");
                put("330203520000", "330203004");
                put("330203570000", "330203008");
                put("330227710000", "330212019");
                put("330227590000", "330212006");
                put("330227720000", "330212020");
                put("330226580000", "330226011");
                put("330205560000", "330205059");
                put("330204580000", "330204028");
                put("330227790000", "330212018");
                put("330205540000", "330205054");
                put("330206560000", "330206087");
                put("330227670000", "330212016");
                put("330281520000", "330281024");
                put("330205520000", "330205055");
                put("330203590000", "330203001");
                put("330226630000", "330226006");
                put("330227530000", "330212002");
                put("330226510000", "330226003");
                put("330227610000", "330212009");
                put("330295560000", "330295560");
                put("330204530000", "330204021");
                put("330203540000", "330203002");
                put("330226520000", "330226014");
                put("330226620000", "330226009");
                put("330205510000", "330205053");
                put("330226530000", "330226015");
                put("330282660000", "330282011");
                put("330282570000", "330282002");
                put("330281590000", "330281015");
                put("330227550000", "330212028");
                put("330226040300", "330226008");
                put("330203510000", "330203003");
                put("330282510000", "330282008");
                put("330281580000", "330281013");
                put("330281690000", "330281019");
                put("330298510000", "330298510");
                put("330283540000", "330283007");
                put("330281630000", "330281010");
                put("330227770000", "330212424");
                put("330282520000", "330282022");
                put("330281550000", "330281012");
                put("330206530000", "330206082");
                put("330227630000", "330212013");
                put("330225550000", "330225003");
                put("330282610000", "330282009");
                put("330226040200", "330226005");
                put("330283560000", "330283004");
                put("330282620000", "330282012");
                put("330225040300", "330225013");
                put("330226660000", "330226002");
                put("330225580000", "330225010");
                put("330283510000", "330283001");
                put("330226970000", "330226010");
                put("330282670000", "330282015");
                put("330204520000", "330204024");
                put("330297510000", "330297001");
                put("330225040100", "330225011");
                put("330204540000", "330204023");
                put("330225040200", "330225012");
                put("330227690000", "330212015");
                put("330226040100", "330226019");
                put("330227510000", "330212026");
                put("330211530000", "330211065");
                put("330204510000", "330204027");
                put("330204560000", "330204025");
                put("330225540000", "330225007");
                put("330226640000", "330226007");
                put("330282560000", "330282016");
                put("330225040400", "330225014");
                put("330282650000", "330282010");
                put("330281710000", "330281017");

            }
        };


//		Log.i("DituxuandianActivity.this", "选点坐标：lon="+p.getLongitude()+"lat="+p.getLatitude());
    }

    public Double getPCSXQLon(String spcsName) {
        Double temp = mapXQLon.get(spcsName);
        return temp;
    }

    public Double getPCSXQLat(String spcsName) {
        Double temp = mapXQLat.get(spcsName);
        return temp;
    }

    public Double getPCSLon(String spcsName) {
        Double temp = mapPCSLon.get(spcsName);
        return temp;
    }

    public Double getPCSLat(String spcsName) {
        Double temp = mapPCSLat.get(spcsName);
        return temp;
    }

    @Override
    public String getPCSCode(String spcsName) {
        String temp = pcsCodeMap.get(spcsName);
        return temp;
    }

    @Override
    public String[] getPCSNameDetail() {
        // TODO Auto-generated method stub
        return m_slistPCSName;
    }

    @Override
    public String tranDept2Jgid(String dept) {
        return dept2jgidMap.get(dept);
    }

//	海曙：选点坐标：lon=121.54030904021909  lat=p29.879426908336626
//	江东：选点坐标：lon=121.56916259908883  lat=p29.878726209152575
//	江北：选点坐标：lon=121.56190733030542  lat=p29.902108407212694
//	北仑：选点坐标：lon=121.8499513384171   lat=p29.912236499178306
//	大榭：选点坐标：lon=121.94248054137404  lat=p29.896609096296032
//	镇海：选点坐标：lon=121.71701440388404  lat=p29.95394406951752
//	鄞州：选点坐标：lon=121.53753143303163  lat=p29.817700972028632
//	余姚市：选点坐标：lon=121.15478286786072lat=30.045970121206864
//	慈溪市：选点坐标：lon=121.24448957886614lat=30.181117233686763
//	奉化\选点坐标：lon=121.39974204624139lat=p29.6521601797551
//	宁海\选点坐标：lon=121.42621061216175lat=p29.28194313896276
//	象山\选点坐标：lon=121.8665846917878lat=p29.46497026149629
//	宁波港：选点坐标：lon=121.76527692737125lat=p29.91348742322336
//	高新区：选点坐标：lon=121.76527692737125lat=p29.890973365310145

//	static String m_slistPcsDeptName[][] = new String[][]{};

//	static String m_slistPCSName [];

//	public PcsNingbo(){
//		setDeptNameDetail
//	}


//		m_slistPcsDeptName = new String[][]{};

//		m_slistPcsDeptName[0] = new String[]{
//				"江东分局",
//				"江东分局白鹤派出所",
//				"江东分局百丈派出所",
//				"江东分局东郊派出所",
//				"江东分局东柳派出所",
//				"江东分局东胜派出所",
//				"江东分局福明派出所",
//				"江东分局广场派出所",
//				"江东分局明楼派出所",
//				"江东分局新城派出所",
//		};
//		m_slistPcsDeptName[1] = new String[]{
//				"海曙分局",
//				"海曙分局白云派出所",
//				"海曙分局段塘派出所",
//				"海曙分局鼓楼派出所",
//				"海曙分局广场派出所",
//				"海曙分局江厦派出所",
//				"海曙分局南门派出所",
//				"海曙分局望春派出所",
//				"海曙分局西门派出所",
//				"海曙分局月湖派出所",
//		};
//		m_slistPcsDeptName[2] = new String[]{
//				"奉化市公安局",
//		};
//		m_slistPcsDeptName[3] = new String[]{
//				"宁海县公安局",
//		};
//		m_slistPcsDeptName[4] = new String[]{
//				"象山县公安局",
//		};
//		m_slistPcsDeptName[5] = new String[]{
//				"宁波港公安局",
//		};
//		m_slistPcsDeptName[6] = new String[]{
//				"慈溪市公安局",
//		};
//		m_slistPcsDeptName[7] = new String[]{
//				"余姚市公安局",
//		};
//		m_slistPcsDeptName[8] = new String[]{
//				"江北分局",
//		};
//		m_slistPcsDeptName[9] = new String[]{
//				"镇海分局",
//		};
//		m_slistPcsDeptName[10] = new String[]{
//				"北仑分局",
//		};
//		m_slistPcsDeptName[11] = new String[]{
//				"鄞州分局",
//		};
//		
//		setFengJuString();


//	public void setFengJuString() {
//
//		m_slistPCSName = new String[]{
//				m_slistPcsDeptName[0][0],
//				m_slistPcsDeptName[0][1],
//				m_slistPcsDeptName[0][2],
//				m_slistPcsDeptName[0][3],
//				m_slistPcsDeptName[0][4],
//				m_slistPcsDeptName[0][5],
//				m_slistPcsDeptName[0][6],
//				m_slistPcsDeptName[0][7],
//				m_slistPcsDeptName[0][8],
//				m_slistPcsDeptName[0][9],
//				m_slistPcsDeptName[0][10],
//				m_slistPcsDeptName[0][11],
//		};
//	
//	}

//	public String[] m_slistPCSName = new String[]{
//		m_slistPcsDeptName[0][0],
//		m_slistPcsDeptName[0][1],
//		m_slistPcsDeptName[0][2],
//		m_slistPcsDeptName[0][3],
//		m_slistPcsDeptName[0][4],
//		m_slistPcsDeptName[0][5],
//		m_slistPcsDeptName[0][6],
//		m_slistPcsDeptName[0][7],
//		m_slistPcsDeptName[0][8],
//		m_slistPcsDeptName[0][9],
//		m_slistPcsDeptName[0][10],
//		m_slistPcsDeptName[0][11],
//	};
//	

//	public static String[] m_slistDeptName = new String[]{
//		"江东分局",
//		"海曙分局",
//		"鄞州分局",
//		"江北分局",
//		"镇海分局",
//		"北仑分局",
//		"余姚市公安局",
//		"慈溪市公安局",
//		"奉化市公安局",
//		"宁海县公安局",
//		"象山县公安局",
//		"宁波港公安局",
//	};
	
	/*			"海曙分局",
	"江东分局",
	"江北分局",
	"北仑分局",
	"大榭分局",
	"镇海分局",
	"鄞州分局",
	"余姚市公安局",
	"慈溪市公安局",
	"奉化市公安局",
	"宁海县公安局",
	"象山县公安局",
	"宁波港公安局",
	"高新区公安局",*/

//	put("海曙分局", "330203");
//	put("江东分局", "330204");
//	put("江北分局", "330205");// 洪塘
//	put("北仑分局", "330206");
//	put("大榭分局", "330207");
//	put("镇海分局", "330211");
//	put("鄞州分局", "330212");
//	put("余姚市公安局", "330281");
//	put("慈溪市公安局", "330282");
//	put("奉化市公安局", "330283");
//	put("宁海县公安局", "330226");
//	put("象山县公安局", "330225");
//	put("宁波港公安局", "330295");
//	put("高新区公安局", "330299");

}
